### Pandas-Dataframe and series

In [2]:
import pandas as pd
## series
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## create a series from dictionary
data = {'a': 1 , 'b':2, 'c':3 , 'd': 4}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
data2 = [10, 20, 30]
indexes = ['a','b','c']
print(pd.Series(data2,index= indexes))

a    10
b    20
c    30
dtype: int64

In [5]:
## DataFrame
## Create a DataFrame from a dictionary of list

data3 = {
    'Name': ['ahmed','mohamed','yousef'],
    'Age': [25,21,22],
    'City':['cairo','alexandria','hurghada']
}
df = pd.DataFrame(data3)
print(df)

      Name  Age        City
0    ahmed   25       cairo
1  mohamed   21  alexandria
2   yousef   22    hurghada

In [6]:
import numpy as np
np.array(df)

array([['ahmed', 25, 'cairo'],
       ['mohamed', 21, 'alexandria'],
       ['yousef', 22, 'hurghada']], dtype=object)

In [7]:
## list of dictionaries
data4 = [
    {'name': 'ahmed','age':25, 'city': 'cairo'},
    {'name': 'mohamed','age':21, 'city': 'alex'},
    {'name': 'yousef','age':22, 'city': 'hurghada'}
]
dff = pd.DataFrame(data4)
print(dff)

      name  age      city
0    ahmed   25     cairo
1  mohamed   21      alex
2   yousef   22  hurghada

In [8]:
np.array(dff)

array([['ahmed', 25, 'cairo'],
       ['mohamed', 21, 'alex'],
       ['yousef', 22, 'hurghada']], dtype=object)

In [9]:
df1 = pd.read_csv('sales_data.csv')
df1.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [10]:
data3

{'Name': ['ahmed', 'mohamed', 'yousef'],
 'Age': [25, 21, 22],
 'City': ['cairo', 'alexandria', 'hurghada']}

In [11]:
df

      Name  Age        City
0    ahmed   25       cairo
1  mohamed   21  alexandria
2   yousef   22    hurghada

In [12]:
df['Name']

0      ahmed
1    mohamed
2     yousef
Name: Name, dtype: object

In [13]:
df.loc[0]

Name    ahmed
Age        25
City    cairo
Name: 0, dtype: object

In [14]:
df.iloc[0][2]

/tmp/ipykernel_3403/2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'cairo'

In [15]:
## accessing a specified element
df

      Name  Age        City
0    ahmed   25       cairo
1  mohamed   21  alexandria
2   yousef   22    hurghada

In [16]:
df.at[1,'City']

'alexandria'

In [17]:
df.iat[1,1]

np.int64(21)

In [18]:
df['Salary'] = [50000,60000,65000]
df

      Name  Age        City  Salary
0    ahmed   25       cairo   50000
1  mohamed   21  alexandria   60000
2   yousef   22    hurghada   65000

In [19]:
## temporary removal until setting inplace to true
df.drop('Salary',axis=1,inplace=True)

In [20]:
df

      Name  Age        City
0    ahmed   25       cairo
1  mohamed   21  alexandria
2   yousef   22    hurghada

In [21]:
df['Age'] = df['Age'] + 1 
df

      Name  Age        City
0    ahmed   26       cairo
1  mohamed   22  alexandria
2   yousef   23    hurghada

In [22]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [23]:
print(df.dtypes)
print(df.describe())

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [24]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000